a.	To take console of Router using Console cable
b.	To assign Ip Address to interfaces of Router using CLI mode.
c.	To allow telnet of the Router to connected End-Devices


         --- System Configuration Dialog ---

Continue with configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#line
Router(config)#line c
Router(config)#line console 0
Router(config-line)#logi
Router(config-line)#login lo
Router(config-line)#login local 
Router(config-line)#username ali password 1234
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#ex









Router con0 is now available






Press RETURN to get started.













User Access Verification

Username: ali
Password: 

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inter
Router(config)#interface g
Router(config)#interface gigabitEthernet 00
                                           ^
% Invalid input detected at '^' marker.
	
Router(config)#interface gigabitEthernet 00
                                           ^
% Invalid input detected at '^' marker.
	
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shu
Router(config-if)#no shutdown 

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#ex
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown 

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
ex
Router(config)#
Router(config)#l
Router(config)#lin
Router(config)#line v
Router(config)#line vty 0 5
Router(config-line)#t
Router(config-line)#transport i
Router(config-line)#transport input t
Router(config-line)#transport input telnet 
Router(config-line)#login local
Router(config-line)#username ali password 1234
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#enable sec
Router(config)#enable secret 1234
Router(config)#ex
Router#
%SYS-5-CONFIG_I: Configured from console by console
ex









Router con0 is now available






Press RETURN to get started.













User Access Verification

Username: 